---
kind: type
id: T:Autodesk.Revit.Exceptions.FamilyContextException
source: html/b9aae3f6-b261-5328-d685-63d4ad046506.htm
---
# Autodesk.Revit.Exceptions.FamilyContextException

The exception that is thrown when an operation is invalid in the current family document, because of the type of family.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class FamilyContextException : InvalidOperationException
```